# INFO 212: Data Science Programming 1
___

### Week 4: Getting Start with Pandas
___

### Mon., April 23, and Wed., April 25, 2018
---

**Question:**
- What capabilities does Python provide to make data cleaning and analysis fast and easy? 

**Objectives:**
- Distinguish pandas Series and DataFrame data structures.
- Apply the essential functionality of DataFrame including indexing, selection, filtering.
- Fill or drop missing values in DataFrame.
- Apply functions to DataFrame values by using map.
- Summarize and compute descriptive statistics.

Pandas will be a major tool of interest for data analysis. It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python. pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib. pandas adopts significant
parts of NumPy’s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## Load the Data Set We Will Work on

```
df = pd.read_csv("datasets/titanic/train.csv")
df.head()
```

In [3]:
df = pd.read_csv("../DataSets/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Pandas DataFrame has a function describe() which calculates some descriptive statistics about the data.

```
df.describe()
```

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
df.describe(include = "O")

                                   Name   Sex  Ticket Cabin Embarked
count                               891   891     891   204      889
unique                              891     2     681   147        3
top     Pettersson, Miss. Ellen Natalia  male  347082    G6        S
freq                                  1   577       7     4      644

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
688,689,0,3,"Fischer, Mr. Eberhard Thelander",male,18.0,0,0,350036,7.7958,NaN,S
785,786,0,3,"Harmer, Mr. Abraham (David Lishin)",male,25.0,0,0,374887,7.2500,NaN,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
529,530,0,2,"Hocking, Mr. Richard George",male,23.0,2,1,29104,11.5000,NaN,S
241,242,1,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q
428,429,0,3,"Flynn, Mr. James",male,NaN,0,0,364851,7.7500,NaN,Q
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
56,57,1,2,"Rugg, Miss. Emily",female,21.0,0,0,C.A. 31026,10.5000,NaN,S
460,461,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S
399,400,1,2,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,240929,12.6500,NaN,S

## Introduction to pandas Data Structures

### Series
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.

```
obj = pd.Series([4, 7, -5, 3])
obj
```

In [8]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

A Series has index and values.

```
obj.values
```

In [9]:
obj.values

array([ 4,  7, -5,  3])

```
obj.index
```

In [10]:
obj.index[2]

2

Each column or row in a DataFrame is a Series.

```
type(df['Age'])
```

In [11]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5       NaN
6      54.0
7       2.0
8      27.0
9      14.0
       ...
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

A Series can be created from dictionary.

```
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3
```

In [12]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah":5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [13]:
obj3.index[3]

'Utah'

The index of a Series can be changed explicitly.

```
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4
```

In [14]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

The values of a Series can be reordered by passing a new index.

```
states=['Texas', 'Ohio', 'Oregon', 'Utah']
obj5 = pd.Series(sdata, index=states)
obj5
```

In [15]:
states = ["Texas", "Ohio", "Oregon", "Utah"]
obj5 = pd.Series(index = states)
obj5

Texas    NaN
Ohio     NaN
Oregon   NaN
Utah     NaN
dtype: float64

### DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection
of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index.

How to create a DataFrame object?

```
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame
```

In [16]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, index = data["year"])
frame

      pop   state  year
2000  1.5    Ohio  2000
2001  1.7    Ohio  2001
2002  3.6    Ohio  2002
2001  2.4  Nevada  2001
2002  2.9  Nevada  2002
2003  3.2  Nevada  2003

```
frame.head()
```

As for Series, If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order.

```
pd.DataFrame(data, columns=['year', 'state', 'pop'])
```

In [17]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dict, it will appear with missing values in the result.

```
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2
frame2.columns
```

In [18]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

```
frame2
```

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute.

```
frame2['state']
```

```
frame2.year
```

How to retrieve rows of a Dataframe?

```
frame2.loc['three']
```

In [19]:
frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

```
frame2.iloc[2]
```

In [20]:
frame2.iloc[2] #integer location

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

How to assign values to a column?

```
frame2['debt'] = [1, 2 ,3] * 2
```

In [21]:
frame2.loc["three"]["state"]

'Ohio'

In [22]:
frame.iloc[2][1]

'Ohio'

In [23]:
frame

      pop   state  year
2000  1.5    Ohio  2000
2001  1.7    Ohio  2001
2002  3.6    Ohio  2002
2001  2.4  Nevada  2001
2002  2.9  Nevada  2002
2003  3.2  Nevada  2003

```
frame2
```

In [24]:
frame2.iloc[2]["state"]

'Ohio'

In [25]:
frame2["debt"] = [1,2,3,4,5,6]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5
six    2003  Nevada  3.2     6

In [26]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

When you are assigning lists or arrays to a column, the value’s length must match the
length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes.

```
debts = pd.Series([1, 2, 3], index = ['one', 'two', 'three'])
frame2['debt'] = debts
```

```
frame2
```

### Index Objects
pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index.

```
frame2.index
```

In [27]:
frame2.index.get_indexer

```
frame2.columns
```

```
frame2.columns[2]
```

```
frame2.index.union(frame2.columns)
```

## Essential Functionality

### Reindexing
An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index.

```
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj
```

In [28]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

```
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2
```

In [29]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values.

```
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
```

In [30]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

```
obj3.reindex(range(6), method='ffill')
```

In [31]:
obj3.reindex(range(6))
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
obj3.reindex(range(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result.

```
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame
```

In [33]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

```
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2
```

In [34]:
frame2 = frame.reindex(["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

```
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states, fill_value=0)
```

In [35]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns = states, fill_value = 0)

   Texas  Utah  California
a      1     0           2
c      4     0           5
d      7     0           8

### Dropping Entries from an Axis
Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic.
The drop method will return a new object with the indicated value or values deleted from
an axis.

How to drop the PassengerId column from the DataFrame?

```
df.drop(['PassengerId', 'Survived'], axis = 1)
```

### Indexing, Selection, and Filtering
For both Series and DataFrame, indices can be used for selection and filtering.

How to find the ages for passengers 1-10?

```
df.iloc[:10, :]['Age']
```

How to find all the passengers whose purchased expensive tickets (> 500)?

```
df[df.Fare > 500]
```

In [45]:
df[df.Fare > 500]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

#### Selection with loc and iloc

How to retrieve the Age, Sex, and Pclass of passengers 10-20?

```
df.loc[10:20, ['Age', 'Sex', 'Pclass']]
```

```
df.columns.get_loc('Age')
```

In [47]:
df.columns.get_loc('Age')

5

```
df.iloc[:10, 4:6]
```

### Arithmetic and Data Alignment
An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the index pairs. For users with database experience, this is similar to an automatic outer join on the index labels.

```
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1
```

```
s2
```

```
s1 + s2
```

#### Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other.

```
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1
df2
```

```
df1 + df2
```

```
df1
```

```
df2
```

```
df1.add(df2, fill_value = 0)
```

#### Operations between DataFrame and Series
Broadcasting allows operations between DataFrame and Series on either rows or columns.

How to subtract an array of values from a matrix?

```
arr = np.arange(12.).reshape((3, 4))
arr
arr[0]
arr - arr[0]
```

How to subtract a Series values from a DataFrame?

```
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame
```

```
frame - series
```

How to subtract values for each column in DataFrame?

```
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2
```

```
series3 = frame['d']
frame
series3
frame.sub(series3, axis='index')
```

### Function Application and Mapping

A frequent operation is applying a function on one-dimensional arrays to each
column or row. DataFrame’s apply method does exactly this:

```
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)
```

In [46]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

               b         d         e
Utah    0.954341  0.719327  0.515215
Ohio    0.747550  0.741933  0.783675
Texas   1.724101  1.930631  0.969288
Oregon  0.779988  0.226431  1.323312

```
f = lambda x: x.max() - x.min()
frame.apply(f)
```

In [ ]:
f = lambda x: x.max() -

```
frame.apply(f, axis='columns')
```

```
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)
```

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame. You can do this with apply
map.

```
format = lambda x: '%.2f' % x
frame.applymap(format)
```

The reason for the name applymap is that Series has a map method for applying an
element-wise function.

```
frame['e'].map(format)
```

### Sorting and Ranking
Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object.

```obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()```

How to sort the columns for the titanic dataframe?

```df.sort_index(axis=1)```

How to sort the titanic data by Age and Fare in descending order?

```df.sort_values(by=['Age', 'Fare'], ascending=False)```

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank.

```obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()```

```obj.rank(method='first')```

```# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')```

```frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')```

### Axis Indexes with Duplicate Labels
Pandas DataFrame allows duplated index or columns

```obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj```

```obj.index.is_unique```

```obj['a']```

```data = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
data.loc['b']```

## Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods.
Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series or a Series of values
from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data.

How many female passengers were there?

```(df.Sex == 'female').sum()```

Who was the oldest passenger?

```df.columns```

```df.iloc[df.Age.idxmax()][['Name', 'Age', 'Sex']]```

### Correlation and Covariance
Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance.

Download the two pickle files and put them under datasets.

```price = pd.read_pickle('datasets/yahoo_price.pkl')
volume = pd.read_pickle('datasets/yahoo_volume.pkl')```

```price.head()```

```volume.head()``

```print(price.index.min(), price.index.max())```

```returns = price.pct_change()
returns.head()```

The corr method of Series computes the correlation of the overlapping, non-NA,
aligned-by-index values in two Series. Relatedly, cov computes the covariance.

```returns['MSFT'].corr(returns['IBM'])```

```returns['MSFT'].cov(returns['IBM'])```

```returns.corr()```

```returns.cov()```

Using DataFrame’s corrwith method, you can compute pairwise correlations
between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each column:

```returns.corrwith(returns.IBM)```

Passing a DataFrame computes the correlations of matching column names.

```returns.corrwith(volume)```

### Unique Values, Value Counts, and Membership
Another class of related methods extracts information about the values contained in a
one-dimensional Series.

How many types of Pclass in the titanic data?

```df.Pclass.unique()```

In [43]:
df.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

How were the passengers distributed among the three Pclasses?

In [44]:
df.Pclass.unique()

array([3, 1, 2])

```df.Pclass.value_counts()```

In [39]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S